{
  "category": "Full Article Content",
  "description": "Complete text content from Sajith Pai's most important articles for bot training",

  "articles": [
    {
      "title": "The Busy Founder's Guide to PMF",
      "url": "https://sajithpai.com/the-busy-founders-guide-to-pmf/",
      "date": "November 30, 2024",
      "full_content": "TL;DR: PMF or Product-Market Fit is not a singular fit, but in fact two sequential fits. First, you need to achieve Product to Problem Fit or PPF (where you validate that your solution is able to address problems for a set of customers), and then you need to achieve (Go-to-Market) Motion to Market Fit, or MMF (where you can reliably, affordably, acquire lookalikes of the above customers to build a large business). Both together help you achieve PMF or Product Market Fit.\n\nProduct-Market Fit = Product to Problem Fit + Motion to Market Fit. PMF = PPF + MMF.\n\nThe biggest error founders make is confusing PPF (product love from a few customers) for PMF, and then pouring on the GTM / customer acquisition fuel in advance of true PMF.\n\nI. Defining PMF\n\nPMF is often the single most important thing that an early stage founder is after. Yet, it is alarming that we still don't have one clear consistent definition or even approach to achieving it. This is worrying because premature scaling in advance of PMF is the key reason for startup failure. And critically it is a gating mechanism for most Series A VCs, and all Series B VCs.\n\nTo clarify:\n- Pre-seed covers product development risk. This stage is where angel investors or friends and family come in (now you see MicroVCs also in this stage).\n- After attaining MVP, you typically raise a seed round. The seed VC comes in and helps cover market development risk and achieve PMF. At this stage, there is proof that a market exists, and that there is a playbook to achieve it.\n- The final stage, post PMF, is the Series A+ stage going from early growth to late growth. Here the key risk is scaling risk. Capital here helps underwrite the risk of scaling to multiple channels or markets.\n\nPMF matters because you need to make sure that before you throw in more money, you know you have acquired the right customers. This is why early stage VCs are concerned about user acquisition strategies like cashback, which can lead to the wrong kind of customers coming on board. PMF means determining genuine demand for the product and ensuring you have a systematic way of tapping this demand.\n\nBefore you go big, you need to get it right. This is what PMF is. It is a way of assuring yourself and your investors of the appeal of the product as well as a plan for growing it systematically. Post PMF, it is effectively a rinse and repeat strategy. PMF is effectively the nailing before the scaling.\n\nMy definition of PMF is that you have a scalable GTM motion enabling predictable, repeatable, unit-positive acquisition of customers with high retention.\n\nGood founders know that PMF is an abstraction layer over 'growth with high retention'. Ideally you want to make sure it is sustainable growth, or growth and retention with good unit economics. A shorthand acronym is GRUE = Growth with Retention and Unit Economics. PMF = GRUE effectively.\n\nII. PPF or Product to Problem Fit\n\nHere you confirm that your product consistently solves the customer's problem. Does the pain that the customer have, a problem that he or she has, go away when they are using your product or solution? If so, you have achieved PPF. That said PPF is not an on/off switch or a zero one thing, it's a continuum of strength of fit. By iterating on the ICP, and/or enhancing the product, you can improve PPF.\n\nHow do you know you have PPF?\n\nSignals include:\n- B2C: High engagement, usage: Retention curve flatlines at 10% at D90\n- B2B: Speed through the funnel - 30-45 days for SMB, 2-3 months for midmarket, 6-9m for enterprise\n- B2C, B2B: Referrals, Word of mouth. Organic channels constitute majority of leads / lots of inbounds etc.\n- Sean Ellis Test: If 40%+ say 'very disappointed' if product gone\n\nImportant: Don't overbuild the product at this stage. Time is money. Break down your assumptions about product-problem fit into modular components and test the hard things first.\n\nFocus on the monkey, not the pedestal! Solve for the hardest thing first!\n\nIII. MMF or Motion to Market Fit\n\nThe second part of PMF is to have a repeatable, scalable GTM or Motion to Market Fit (MMF).\n\nYou hit MMF and thereby PMF when you have a scalable affordable go to market motion, i.e., you have predictability and repeatability of customer acquisition and that means a clear input output ratio. In addition, you are not overpaying for the customer, and you are also able to retain the customer.\n\nGTM comprises persona (customer type you wish to serve), channel (to reach the persona) and finally the message or proposition for the customer re your product.\n\n'Uncomfortably narrow' personas addressed by one hero channel through a sharp message is how first-time MMF is achieved.\n\nTo achieve Motion-to-Market fit, iterate systematically and strategically. If you are not hitting MMF, then start by changing the message, and if it doesn't work, then the channel, then the persona and only then the product. Messages are easy to change. You can also change channels. Finally, then you need to change the persona you're targeting and this is hard - you're getting into pivots. Product pivots are harder. Because you have money for 18 months typically, you have at best 1 market pivot and 1 product pivot.\n\nThe best founders think of product and distribution as joined at the hip. They think about distribution at the time of product development. They identify a proprietary or untapped distribution channel.\n\nAs far as possible, pivot on the market, not the product. It is much harder to change the product to fit the market; vice versa is what you are seeking.\n\nSigns of MMF:\n- Monthly double digit growth\n- Retention: Churn <3% for enterprise, <7% for midmarket, <20% for SMB; Churn <10% for B2C paid users\n- Sustainable unit economics (CM2+): LTV:CAC 3:1 or S&M costs as 1/3rd of contribution margin or Sales yield > 1\n\nRemember: PrePMF startups are a learning machine, not an earning machine. Don't scale up revenue by pouring on the marketing $ unless you have achieved MMF and PMF.\n\nIV. The founder's role during PMF\n\nDuring PPF stage, the founder is effectively the Product Head. In B2C products, launch beta and gauge reaction. In B2B, co-create with customers or give special offers for trials. The key is increasing iterations and feedback to learn faster. Believe what they do, not what they tell.\n\nFor MMF stage, what you are testing is the playbook for GTM + monetisation. Is the energy expended to transfer a rupee from the consumer's wallet to yours, the lowest possible? In B2B, founder should do sales meetings for first-hand feel. In B2C, determine most effective customer acquisition path.\n\nV. Additional thoughts on PMF\n\nPMF is not a one-and-done thing. PMF can come and go (ask Paytm's Wallet team or the Clubhouse guys). At every stage of growth, your quality of PM Fit can change/weaken.\n\nPMF is a grind. Most PMF achievements are a steady, slow grind. It is a lot of fiddling with the dials till you hit high fidelity."
    },

    {
      "title": "The Congruent Square",
      "url": "https://sajithpai.com/the-congruent-square/",
      "date": "November 2021",
      "summary": "Of late, I have been thinking of a concept I call the Congruent Square (or Rhombus for the math-purist) to better explain to founders why some of them are struggling with hitting product market fit (PMF).",
      "key_concept": "Pre-PMF startups need tight alignment between four key mechanisms: Product, Market, GTM, and Team. Lack of alignment/congruency between these four can be damaging to achieving PMF."
    },

    {
      "title": "Why CM2+ Matters for Startups",
      "url": "https://sajithpai.com/why-cm2-matters-for-startups/",
      "date": "November 2023",
      "summary": "The term 'CM2+' (pronounced CM2 positive) is frequently used in startup conversations, but often its true meaning and significance are misunderstood or not apparent. In this note I explain its significance and why becoming CM2+ is a key goal that early stage startups should strive for, and why it is integrally linked with getting to PMF (product-market fit).",
      "key_concept": "CM2 = Contribution Margin 2 = Revenue - COGS - Variable costs - Customer acquisition costs. Getting to CM2+ is a good shorthand for getting to PMF."
    },

    {
      "title": "The PMF X-Ray Framework",
      "url": "https://sajithpai.com/the-pmf-x-ray-framework/",
      "date": "September 2025",
      "summary": "The journey of a startup from idea to product market fit (PMF) goes through three stages.",
      "key_concept": "A structured way to understand choices and tradeoffs startups took on route to achieving (or not) PMF. Stages: Idea stage (The Pick), PPF stage, MMF stage."
    },

    {
      "title": "Nailing Capital vs Scaling Capital",
      "url": "https://sajithpai.medium.com/nailing-capital-vs-scaling-capital-70b2b22b553d",
      "platform": "Medium",
      "summary": "Thoughts and reflections inspired by the frenzied pace of investing and deal making we are seeing in the early stage ecosystem in India.",
      "key_concept": "Nailing capital is for figuring out PMF (seed stage). Scaling capital is for growth after PMF (Series A+). Raising scaling capital before achieving PMF leads to premature scaling - a key cause of startup failure."
    },

    {
      "title": "Exhaust Fumes - Understanding Startup Valuations",
      "url": "https://sajithpai.medium.com/exhaust-fumes-or-understanding-startup-valuations-610897d7bcf8",
      "platform": "Medium",
      "key_quote": "Early stage valuations aren't really valuations. They are the exhaust fumes of a negotiation about two things — the amount raised and the ownership percentage.",
      "key_concept": "Don't obsess over valuation - focus on building the business."
    },

    {
      "title": "Narrative Capital",
      "url": "https://sajithpai.medium.com/narrative-capital-cff7bc28664",
      "platform": "Medium",
      "summary": "A fan reached out to me after a recent tweet of mine, asking for a 'smol essay' on what I meant by the term 'narrative capital'.",
      "key_concept": "The story and perception around your company helps in fundraising, recruiting, and partnerships."
    },

    {
      "title": "The best VCs are long, preloaded, context windows for their founders",
      "url": "https://sajithpai.com/the-best-vcs-are-long-preloaded-context-windows-for-their-founders/",
      "date": "May 2025",
      "key_concept": "VCs should bring context and pattern recognition from their portfolio experience to help founders."
    },

    {
      "title": "The Four Routes to Starting Up",
      "url": "https://sajithpai.com/the-four-routes-to-starting-up/",
      "date": "April 2025",
      "summary": "In my role as an early stage VC, I often get asked by aspiring founders for my reactions to, and feedback on, their startup ideas. This article is borne out of the learnings from those interactions.",
      "key_concept": "Four routes to picking a startup idea: Pain, Personal experience, Prospecting, Opportunism."
    }
  ]
}
